blog.org
#+TITLE: Personal Blog
#+AUTHOR: Ryan Cummings

#+HUGO_BASE_DIR: ./
#+HUGO_AUTO_SET_LASTMOD: t

*** DONE Step 2 CS Mneumonics                                        :step:
CLOSED: [2020-02-20 Thu 15:29]
:PROPERTIES:
:EXPORT_FILE_NAME: step2cs-mneumonics
:END:
I took Step 2 CS back in October 2019, and (after a very stressful waiting period) found out that I passed with flying colors. The mneumonics below were the best I could find, and memorizing them a few nights before the exam saved me.
**** Social: TAIMODES:

- Tobacco
- Alcohol
- Illicit drugs
- Married
- Occupation
- Diet
- Exercise
- Sex
- ROS

**** PMH: PAM HITS FOSS

- Past medical
- Allergies
- Meications
- Hospitalizations
- Ill contacts
- Trauma
- Surgical
- Family
- OBGYN
- Sexual
- Social

**** Women's Health: LMP RTV PAP

- LMP
- Menarche
- Periods last?
- Regularity
- Tampons
- Vaginal discharge
- Cramps
- Spotting
- Pregnancy
- Abortions
- Pap smear

**** ROS Hitlist

- Nausea
- Vomiting
- Fever
- Chills
- SOB
- CP
- Changes in hearing/vision
- Changes in bowel/bladder
- Rash or skin changes
- Trauma
- Falls
- Loss of consciousness
- Swelling
- Vaginal discharge
- New numbness, tingling, weakness
- Confusion
- Recent illnesses
- Change in meds
- Pain anywhere else
