content/posts/step2cs-mneumonics.md
+++
title = "Step 2 CS Mneumonics"
author = ["Ryan Cummings"]
date = 2020-02-20T15:29:00-05:00
lastmod = 2020-02-20T16:13:11-05:00
tags = ["step"]
categories = ["academic"]
draft = false
+++

I took Step 2 CS back in October 2019, and (after a very stressful waiting period) found out that I passed with flying colors. The mneumonics below were the best I could find, and memorizing them a few nights before the exam saved me.


## Social: TAIMODES: {#social-taimodes}

-   Tobacco
-   Alcohol
-   Illicit drugs
-   Married
-   Occupation
-   Diet
-   Exercise
-   Sex
-   ROS


## PMH: PAM HITS FOSS {#pmh-pam-hits-foss}

-   Past medical
-   Allergies
-   Meications
-   Hospitalizations
-   Ill contacts
-   Trauma
-   Surgical
-   Family
-   OBGYN
-   Sexual
-   Social


## Women's Health: LMP RTV PAP {#women-s-health-lmp-rtv-pap}

-   LMP
-   Menarche
-   Periods last?
-   Regularity
-   Tampons
-   Vaginal discharge
-   Cramps
-   Spotting
-   Pregnancy
-   Abortions
-   Pap smear


## ROS Hitlist {#ros-hitlist}

-   Nausea
-   Vomiting
-   Fever
-   Chills
-   SOB
-   CP
-   Changes in hearing/vision
-   Changes in bowel/bladder
-   Rash or skin changes
-   Trauma
-   Falls
-   Loss of consciousness
-   Swelling
-   Vaginal discharge
-   New numbness, tingling, weakness
-   Confusion
-   Recent illnesses
-   Change in meds
-   Pain anywhere else
